<template>
    <div>
        <h1>Summary概要</h1>
        <p>挂机脚本程序实现原理</p>
        <p>
            模式1（识别模式）：使用ADB截图屏幕，使用图片识别/文字识别屏幕的坐标点位，使用ADB触发点击
            （识别模式可以优化，识别过一次之后，只要屏幕分辨率没有变，就可以记录下这次的坐标，下次直接使用坐标进行）
        </p>
        <p>
            模式2（手动模式）：使用ADB截图屏幕，手动定位坐标，把坐标位置记录起来，保存每个坐标点击的顺序，间隔时间，重复次数，使用ADB按照命令依次执行
        </p>
        <p>
            模式3（半自动模式）：结合上面两种情况，手动模式的缺点就是，如果需要经历一些不确定的时间间隔，这时候需要识别技术来判断是否间隔结束，
            类似于崩铁挂机打完了，要判断得到是否刷完了这次副本，打这个副本的时间可长可短，还可能失败需要重刷，这个时候手动模式就没办法满足需求
        </p>
    </div>
</template>
  
<script>
export default {
    name: 'Summary',
    data() {
        return {
        }
    },
    methods: {
    },
    mounted() {
        console.log("Summary mounted");
    },
}
</script>
  